/*-----------------------------------------------------------------------------
 * Module Name: cfm_om.h
 *-----------------------------------------------------------------------------
 * PURPOSE: Definitions for the CFM object manager
 *-----------------------------------------------------------------------------
 * NOTES:
 *
 *-----------------------------------------------------------------------------
 * HISTORY:
 *    12/5/2006 - macauley_cheng, Created
 *
 *
 *-----------------------------------------------------------------------------
 * Copyright(C)                               Accton Corporation, 2006
 *-----------------------------------------------------------------------------
 */

#ifndef _CFM_OM_H
#define _CFM_OM_H

#include "cfm_type.h"
#include "cfm_timer.h"
#include "sysrsc_mgr.h"
#if (SYS_CPNT_CFM == TRUE)

#define CFM_OM_MD_MA_MEP_KEY           0x01
#define CFM_OM_LPORT_MD_MA_KEY         0x00
#define CFM_OM_MD_MA_LPORT_KEY         0x01
#define CFM_OM_MD_MA_MEP_SEQ_REC_KEY   0x00


typedef struct CFM_OM_VlanList_S
{
    UI16_T vlan_id;

    struct CFM_OM_VlanList_S *next_p;
}CFM_OM_VlanList_T;

typedef struct CFM_OM_MA_S
{
    CFM_TYPE_MA_Name_T               format;
    CFM_TYPE_MhfCreation_T           mhf_creation;
    CFM_TYPE_CcmInterval_T           ccm_interval;
    CFM_TYPE_CrossCheckStatus_T      cross_check_status;
    CFM_TYPE_CcmStatus_T             ccm_status;
    CFM_TYPE_MhfIdPermission_T       mhf_id_permission;

    CFM_TYPE_AIS_STATUS_T            ais_status;
    CFM_TYPE_AIS_STATUS_T            ais_supress_status;
    CFM_TYPE_MdLevel_T               ais_send_level;

    UI32_T                           index;
    UI32_T                           remote_mep_down_counter;
    UI32_T                           num_of_vids;
    UI16_T                           primary_vid;
    UI16_T                           fault_alarm_domain;
    UI16_T                           ais_period;
    I16_T                             ais_rcvd_timer_idx;
    UI8_T                            name_length;
    UI8_T                            name_a[CFM_TYPE_MA_MAX_NAME_LENGTH+1];
    UI8_T                            fault_alarm_des_address_a[SYS_ADPT_MAC_ADDR_LEN];
    I16_T                            md_ar_idx;
    I16_T                            next_ar_idx;
    I16_T                            ar_idx;
    BOOL_T                           used;
    UI8_T vid_bitmap_a[(SYS_DFLT_DOT1QMAXVLANID/8)+1];
}CFM_OM_MA_T;


typedef struct CFM_OM_MD_S
{
    CFM_TYPE_MD_Name_T              format;
    CFM_TYPE_MdLevel_T              level;
    CFM_TYPE_MhfCreation_T          mhf_creation;
    CFM_TYPE_FNG_LowestAlarmPri_T   low_pri_def;
    CFM_TYPE_MhfIdPermission_T      mhf_id_permission;

    UI32_T                          index;
    UI32_T                          mep_achive_holdtime;
    UI32_T                          next_available_ma_index;
    UI32_T                          fng_alarm_time;
    UI32_T                          fng_reset_time;
    UI16_T                          fault_alarm_domain;
    UI8_T                           name_length;
    UI8_T                           name_a[CFM_TYPE_MD_MAX_NAME_LENGTH+1];
    UI8_T                           fault_alarm_dest_address_a[SYS_ADPT_MAC_ADDR_LEN];
    BOOL_T                          used;
    I16_T                           ar_idx;
    I16_T                           next_ar_idx;
    I16_T                           ma_start_ar_idx;

}CFM_OM_MD_T;

#pragma pack(1)

typedef struct CFM_OM_MEP_S
{
    UI32_T                           md_index;         /*key*/
    UI32_T                           ma_index;         /*key*/
    UI32_T                           identifier;       /*key*/
    UI32_T                           lport;            /*key*/
    UI32_T                           ccm_ltm_priority;

    CFM_TYPE_CcmStatus_T             cci_status;

    UI16_T                           primary_vid;

    UI8_T                            mac_addr_a[SYS_ADPT_MAC_ADDR_LEN];
    UI8_T                            direction;

    BOOL_T                           active;
    BOOL_T                           enable_rmep_defect;

    /*fng
     */
    CFM_TYPE_FNG_State_T             fng_machine_state;
    CFM_TYPE_FNG_HighestDefectPri_T  highest_pri_defect;
    CFM_TYPE_FNG_LowestAlarmPri_T    lowest_priority_defect;
    CFM_TYPE_FNG_HighestDefectPri_T  last_notify_defect;            /* to record the last notified ccm defect */
    UI32_T                           fng_reset_time;
    UI32_T                           fng_alarm_time;

    /*MaDefectIndication
     */
    UI32_T                           error_ccm_last_failure_lenth;
    UI32_T                           xcon_ccm_last_failure_length;
    UI32_T                           rcvd_ccm_sequenc_errors;        /*total number of out-of-seq CCMs received from all remote meps*/
    UI32_T                           rcvd_ccm_amount;
    UI32_T                           cci_sent_ccms;                  /*total number of ccm transmitted.*/

    UI32_T                           rmep_port_down_cnt; /* 0 - no remote MEP port down     */
    UI32_T                           rmep_inf_down_cnt;  /* 0 - all remote MEP interface up */
    UI32_T                           rmep_ccm_loss_cnt;  /* 0 - no remote MEP CCM lost      */
    UI32_T                           rmep_rdi_on_cnt;    /* 0 - no remote MEP RDI           */
    UI32_T                           rmep_lrn_cnt;       /* 0 - no remote MEP learnt        */

    BOOL_T                           some_rdi_defect;     /* remote mep send rdi */
    BOOL_T                           err_mac_status;
    BOOL_T                           some_rmep_ccm_defect;
    BOOL_T                           error_ccm_defect;
    BOOL_T                           xcon_ccm_defect;

    UI8_T                            error_ccm_last_failure_a[CFM_TYPE_MAX_FRAME_RECORD_SIZE];      /*last-received CCM that triggered an defErrorCCm Fault*/
    UI8_T                            xcon_ccm_last_failure_a[CFM_TYPE_MAX_FRAME_RECORD_SIZE];       /*the last-received CCM that triggered a defXconCCM fault*/


    /*lbr
     */
    UI32_T                          lbr_out;                         /*total number of lbr transmitted*/
    UI32_T                          lbr_in;                          /*total number of valid, in-order lbr received*/
    UI32_T                          lbr_in_out_of_order;             /*total number of valid, out-of-order lbr received.*/
    UI32_T                          lbr_bad_msdu;                    /*option, 12.14.7.1.3:aa*/

    /*lbm
     */
    UI32_T                          next_lbm_trans_id;
    UI32_T                          transmit_lbm_seq_number;
    UI32_T                          lbm_current_recevied_seq_number;
    UI32_T                          transmit_lbm_data_tlv_length;
    I32_T                           transmit_lbm_vlan_priority;
    UI32_T                          transmit_lbm_dest_mep_id;
    I16_T                           transmit_lbm_messages;

    UI8_T                           transmit_lbm_dest_mac_address_a[SYS_ADPT_MAC_ADDR_LEN];

    UI8_T                           transmit_lbm_data_tlv_a[CFM_TYPE_MAX_FRAME_RECORD_SIZE];
    UI8_T                           transmit_lbm_data_a[CFM_TYPE_MAX_FRAME_SIZE];

    BOOL_T                          transmit_lbm_dest_is_mep_id;
    BOOL_T                          tramsmit_lbm_status;
    BOOL_T                          transmit_lbm_vlan_drop_enable;
    BOOL_T                          transmit_lbm_result_oK;


    /*ltr
     */
    UI32_T                         unexp_ltr_in;                       /*total nunber of unexpected LTRs received*/
    UI8_T                          ltr_reply_ttl;
    UI8_T                          ltr_relay_action;

    /*ltm
      */
    UI32_T                         ltm_next_seq_number;
    UI32_T                         transmit_ltm_target_mep_id;
    UI32_T                         transmit_ltm_seq_number;

    UI8_T                          transmit_ltm_target_mac_address_a[SYS_ADPT_MAC_ADDR_LEN];
    UI8_T                          transmit_ltm_egress_identifier[SYS_ADPT_MAC_ADDR_LEN+2];
    UI8_T                          transmit_ltm_ttl;

    BOOL_T                         transmit_ltm_target_is_mep_id;
    BOOL_T                         transmit_ltm_result;
    BOOL_T                         transmit_ltm_status;
    BOOL_T                         ltm_use_fdb_only;

    CFM_OM_MD_T                    *md_p;
    CFM_OM_MA_T                    *ma_p;
    I16_T                          md_ar_idx;
    I16_T                          ma_ar_idx;

    /*all timer
     */
    I16_T                          cci_while_timer_idx;
    I16_T                          error_ccm_while_timer_idx;
    I16_T                          xcon_ccm_while_timer_idx;
    I16_T                          fng_while_timer_idx;
    I16_T                          ais_send_timer_idx;
}CFM_OM_MEP_T;

typedef struct CFM_OM_MIP_S
{
    UI32_T                 md_index;   /*key*/
    UI32_T                 ma_index;   /*key*/
    UI32_T                 lport;      /*key*/
    CFM_OM_MD_T            *md_p;
    CFM_OM_MA_T            *ma_p;
    I16_T                  md_ar_idx;
    I16_T                  ma_ar_idx;
    UI8_T                  mac_address_a[SYS_ADPT_MAC_ADDR_LEN];
}CFM_OM_MIP_T;

typedef struct CFM_OM_REMOTE_MEP_S
{
    UI32_T                              md_index;       /*key*/
    UI32_T                              ma_index;       /*key*/
    UI32_T                              identifier;     /*key*/
    UI32_T                              next_sequence;
    UI32_T                              failed_ok_time; /*at ok or fail state timestamp*/
    UI32_T                              rcvd_lport;
    UI32_T                              cc_life_time;
    UI32_T                              frame_loss;
    UI32_T                              packet_received;
    UI32_T                              packet_error;
    I32_T                               age_out;

    UI8_T                               mac_addr_a[SYS_ADPT_MAC_ADDR_LEN];
    UI8_T                               sender_chassis_id_length;
    UI8_T                               sender_chassis_id[CFM_TYPE_MAX_CHASSIS_ID_LENGTH+1];

    UI8_T                               man_length;
    UI8_T                               man_address[CFM_TYPE_MAX_MAN_ADDRESS_LENGTH+1];

    UI8_T                               man_domain_length;
    UI8_T                               man_domain_address[CFM_TYPE_MAX_MAN_ADDRESS_LENGTH+1];

    BOOL_T                              mep_up;
    BOOL_T                              rdi;        /*20.19.2 rdi flag from last received ccm*/
    BOOL_T                              ccm_defect; /*20.19.1, report ccm has been received from reote mep for at least (3.25*ccm_interval)*/

    /*the mep id and direction of received the retmoe mep's CCM*/
    UI32_T                              rcvd_mep_id;
    CFM_TYPE_MP_Direction_T             rcvd_mep_direction;
    CFM_TYPE_PortStatus_T               port_status;
    CFM_TYPE_InterfaceStatus_T          interface_status;
    CFM_TYPE_TlvChassisIdSubtype_T      sender_chassis_id_sub_type;
    CFM_TYPE_RemoteMepState_T           machine_state;

    CFM_OM_MD_T                         *md_p;
    CFM_OM_MA_T                         *ma_p;

    I16_T                               md_ar_idx;
    I16_T                               ma_ar_idx;

    I16_T                               rmep_while_timer_idx;
    I16_T                               archive_hold_timer_idx;

}CFM_OM_REMOTE_MEP_T;


typedef struct CFM_OM_LTR_S
{
    UI32_T                              md_index;/*Key*/
    UI32_T                              ma_index;/*Key*/
    UI32_T                              rcvd_mep_id;/*Key*/
    UI32_T                              seq_number;/*Key*/
    UI32_T                              receive_order;/*Key*/
    UI32_T                              reply_ttl;

    BOOL_T                              forwarded;
    BOOL_T                              terminal_mep;

    UI8_T                               last_egress_identifier[SYS_ADPT_MAC_ADDR_LEN+2];
    UI8_T                               next_egress_identifier[SYS_ADPT_MAC_ADDR_LEN+2];

    UI8_T                               chassis_id_length;
    UI8_T                               chassis_id[CFM_TYPE_MAX_CHASSIS_ID_LENGTH+1];

    UI8_T                               mgmt_addr_domain_len;
    UI8_T                               mgmt_addr_domain[CFM_TYPE_MAX_MAN_ADDRESS_LENGTH+1];
    UI8_T                               mgmt_addr_len;
    UI8_T                               mgmt_addr[CFM_TYPE_MAX_MAN_ADDRESS_LENGTH+1];

    UI8_T                               ingress_mac[SYS_ADPT_MAC_ADDR_LEN];
    UI8_T                               ingress_port_id_subtype;
    UI8_T                               ingress_port_id_lenth;
    UI8_T                               ingress_port_Id[CFM_TYPE_MAX_PORT_ID_LENGTH];

    UI8_T                               egress_mac[SYS_ADPT_MAC_ADDR_LEN];
    UI8_T                               egress_port_id_subtype;
    UI8_T                               egress_port_id_lenth;
    UI8_T                               egress_port_id[CFM_TYPE_MAX_PORT_ID_LENGTH];

    CFM_TYPE_EgressAction_T             egress_action;
    CFM_TYPE_IngressAction_T            ingress_action;
    CFM_TYPE_TlvChassisIdSubtype_T      chassis_id_subtype;
    CFM_TYPE_RelayAction_T              relay_action;

    UI32_T                              org_tlv_length;
    UI8_T                               org_specific_tlv_a[CFM_TYPE_MAX_ORGANIZATION_TLV_LENGTH];

    I16_T                               hold_timer_idx;
}CFM_OM_LTR_T;
#pragma pack()

typedef struct CFM_OM_GlobalConfig_S
{
    CFM_TYPE_CfmStatus_T                 cfm_status;

    /*cross check configuration
     */
    UI32_T                               remote_mep_start_delay;

    /*link trace global configuration
     */
    UI32_T                               link_trace_hold_time;
    UI32_T                               link_trace_size;
    CFM_TYPE_LinktraceStatus_T           link_trace_cache_status;

    /*snmp trap global configuration
     */
    BOOL_T                               snmp_cc_mep_up_trap;
    BOOL_T                               snmp_cc_mep_down_trap;
    BOOL_T                               snmp_cc_config_trap;
    BOOL_T                               snmp_cc_loop_trap;
    BOOL_T                               snmp_cross_check_mep_unknown_trap;
    BOOL_T                               snmp_cross_check_mep_missing_trap;
    BOOL_T                               snmp_cross_check_ma_up_trap;
}CFM_OM_GlobalConfig_T;

typedef struct CFM_OM_LTR_QueueElement_S
{
    UI32_T                               lport;
    UI16_T                               pduLen;
    UI16_T                               vid;
    UI16_T                               priority;

    UI8_T                                level;
    UI8_T                                *pdu_p;
    UI8_T                                src_mac_a[SYS_ADPT_MAC_ADDR_LEN];
    UI8_T                                dst_mac_a[SYS_ADPT_MAC_ADDR_LEN];

    struct CFM_OM_LTR_QueueElement_S     *next_element_p;
}CFM_OM_LTR_QueueElement_T;

typedef struct CFM_OM_LTR_QUEUE_HEAD_S
{
    UI32_T                               enqueued_LTRs;

    struct CFM_OM_LTR_QueueElement_S     *first_pdu_p;
    struct CFM_OM_LTR_QueueElement_S     *last_pdu_p;
}CFM_OM_LTR_QUEUE_HEAD_T;

typedef struct CFM_OM_ErrorListElement_S
{
    CFM_TYPE_MdLevel_T                   level;
    UI32_T                               mp_id;
    UI32_T                               lport;
    UI32_T                               error_time;

    CFM_TYPE_MEP_ConfigError_T           last_reason;

    UI16_T                               vid;
    I16_T                                md_ar_idx;
    I16_T                                ma_ar_idx;
    I16_T                                ar_idx;

    UI8_T                                mac_a[SYS_ADPT_MAC_ADDR_LEN];
    UI8_T                                reason_bit_map;
    BOOL_T                               used;

    I16_T     nxt_ar_idx;
}CFM_OM_ErrorListElement_T;

typedef struct CFM_OM_ErrorListHead_S
{
    UI32_T          errors_number;
    I16_T           first_ar_idx;
    I16_T           last_ar_idx;
}CFM_OM_ErrorListHead_T;

/*
  Below define the loop back message link list structure
*/
typedef struct CFM_OM_LoopBackListElement_S
{
    UI32_T   lbm_seq_number;
    UI32_T   received_time;

    BOOL_T   used;
    I16_T    ar_idx;
    I16_T    md_ar_idx;
    I16_T    ma_ar_idx;
    I16_T    next_ar_idx;
}CFM_OM_LoopBackListElement_T;

typedef struct CFM_OM_LoopBackListHead_S
{
    I16_T   first_ar_idx;
    I16_T   last_ar_idx;
}CFM_OM_LoopBackListHead_T;

/* for delay measurement
 */
typedef struct CFM_OM_DmrRec_S
{
    UI32_T      dmm_txf_10ms;
    UI32_T      frame_delay_ms;
    UI32_T      fdv_ms;        /* frame delay variation in ms */
    UI8_T       rec_state;
}CFM_OM_DmrRec_T;

typedef struct CFM_OM_DmmCtrlRec_S
{
    CFM_OM_DmrRec_T     dmr_rec_ar[CFM_TYPE_MAX_DMM_COUNT]; /* for send sequence and result */
    UI16_T              src_mep_id;
    UI16_T              dst_mep_id;
    UI16_T              pkt_size;           /* not including (da + sa + eth + fcs) = total size - 18 */
    UI16_T              pkt_pri;            /* priority to tx PDU */
    I16_T               tx_timer_idx;
    UI8_T               dst_mac_ar[SYS_ADPT_MAC_ADDR_LEN];
    UI8_T               dmr_seq_ar[CFM_TYPE_MAX_DMM_COUNT]; /* 1-based, for rcvd sequence */
    UI8_T               md_name_ar[CFM_TYPE_MD_MAX_NAME_LENGTH+1];
    UI8_T               ma_name_ar[CFM_TYPE_MA_MAX_NAME_LENGTH+1];
    UI8_T               md_name_len;
    UI8_T               ma_name_len;
    UI8_T               cur_dmm_seq;
    UI8_T               cur_rcv_idx;
    UI8_T               counts;
    UI8_T               interval;           /* sec      */
    UI8_T               timeout;            /* sec      */
    UI8_T               next_send_timer;    /* sec      */
    UI8_T               fst_timeout_id;     /* 0-based  */
    BOOL_T              is_busy;
}CFM_OM_DmmCtrlRec_T;

/* for throughput measurement
 */
typedef struct CFM_OM_LbmCtrlRec_S
{

    UI32_T              beg_trans_id;
    UI32_T              end_trans_id;
    UI16_T              src_mep_id;
    UI16_T              dst_mep_id;
    UI16_T              counts;             /* pkts     */
    UI16_T              pkt_size;           /* not including (da + sa + eth + fcs) = total size - 18 */
    UI16_T              real_send_counts;   /* pkts     */
    UI16_T              rcv_in_1sec;        /* pkts     */
    UI16_T              rcv_in_time;        /* pkts     */
    UI16_T              pattern;            /* pattern in data TLV */
    UI16_T              pkt_pri;            /* priority to tx PDU */
    I16_T               timeout_timer_idx;
    UI8_T               dst_mac_ar[SYS_ADPT_MAC_ADDR_LEN];
    UI8_T               md_name_ar[CFM_TYPE_MD_MAX_NAME_LENGTH+1];
    UI8_T               ma_name_ar[CFM_TYPE_MA_MAX_NAME_LENGTH+1];
    UI8_T               md_name_len;
    UI8_T               ma_name_len;
    UI8_T               timeout;            /* sec      */
    UI8_T               time_pass;          /* sec      */
    UI8_T               res_bmp;
    BOOL_T              is_busy;
}CFM_OM_LbmCtrlRec_T;

/*
Below define the information which will give to UI
*/
typedef struct CFM_OM_GlobalConfigInfo_S
{
    CFM_TYPE_CfmStatus_T               cfm_global_status;
    UI32_T                             start_delay;

    /*link trace*/
    CFM_TYPE_LinktraceStatus_T         linktrace_cache_status;
    UI32_T                             linktrace_cache_holdTime;
    UI32_T                             linktrace_cache_size;

    /*trap*/
    BOOL_T                             cc_mep_up;
    BOOL_T                             cc_mep_down;
    BOOL_T                             cc_config;
    BOOL_T                             cc_loop;
    BOOL_T                             cross_mep_unknown;
    BOOL_T                             cross_mep_missing;
    BOOL_T                             cross_ma_up;

}CFM_OM_GlobalConfigInfo_T;

typedef struct CFM_OM_MdInfo_S
{
    UI32_T                            index;
    CFM_TYPE_MD_Name_T                name_format;
    CFM_TYPE_MdLevel_T                level;

    CFM_TYPE_MhfCreation_T            mhf_creation;
    CFM_TYPE_MhfIdPermission_T        permission;
    CFM_TYPE_FNG_LowestAlarmPri_T     lowest_alarm_pri;

    UI32_T                            next_index;
    UI32_T                            mep_archive_hold_time;
    UI32_T                            fng_alarm_time;
    UI32_T                            fng_reset_time;
    UI32_T                            row_status;
    UI16_T                            name_len;

    UI8_T                             name_a[CFM_TYPE_MD_MAX_NAME_LENGTH+1];
}CFM_OM_MdInfo_T;

typedef struct CFM_OM_MaInfo_S
{
    UI32_T                              ma_index;
    UI32_T                              md_index;
    UI32_T                              num_of_vids;
    UI32_T                              row_status;

    CFM_TYPE_MA_Name_T                  name_format;
    CFM_TYPE_MhfCreation_T              mhf_creation;
    CFM_TYPE_MhfIdPermission_T          permission;
    CFM_TYPE_CcmInterval_T              interval;
    CFM_TYPE_MdLevel_T                  md_level;
    CFM_TYPE_CcmStatus_T                ccm_status;
    UI16_T                              primary_vid;
    UI16_T                              md_name_len;
    UI16_T                              ma_name_len;
    /*ais*/
    CFM_TYPE_AIS_STATUS_T               ais_status;
    /* ais_suppress_status == TRUE
     *   1. only suppress TRAP
     *     all         in CFM_ENGINE_XmitFaultAlarm &&
     *     MEP_MISSING in CFM_ENGINE_XmitCrossCheckTrap
     *   2. only be effective after AIS is received
     */
    CFM_TYPE_AIS_STATUS_T               ais_suppress_status;
    CFM_TYPE_MdLevel_T                  ais_level;
    UI16_T                              ais_period;
    /* ais_suppresing == TRUE if
     *   AIS received && suppress alarm enabled && crosscheck enabled
     */
    BOOL_T                              ais_suppresing;

    UI8_T                               vlan_list_a[(SYS_DFLT_DOT1QMAXVLANID/8)+1];
    UI8_T                               ma_name_a[CFM_TYPE_MA_MAX_NAME_LENGTH+1];
    UI8_T                               md_name_a[CFM_TYPE_MD_MAX_NAME_LENGTH+1];
}CFM_OM_MaInfo_T;

typedef struct CFM_OM_MepFngConfig_E
{
    UI32_T                              mep_id;
    UI32_T                              fng_alarm_time;
    UI32_T                              fng_reset_time;

    CFM_TYPE_FNG_HighestDefectPri_T     highest_defect;     /* defect ever occurred b4 */
    CFM_TYPE_FNG_LowestAlarmPri_T       lowest_alarm_pri;

    UI16_T                              md_name_len;
    UI16_T                              ma_name_len;

    UI8_T                               md_name_a[CFM_TYPE_MD_MAX_NAME_LENGTH+1];
    UI8_T                               ma_name_a[CFM_TYPE_MA_MAX_NAME_LENGTH+1];
}CFM_OM_MepFngConfig_T;

typedef struct CFM_OM_MepInfo_S
{
    UI32_T                              md_index;
    UI32_T                              identifier;
    UI32_T                              lport;                                                /*2*/
    UI32_T                              ma_index;
    UI32_T                              primary_vid;                                          /*4*/
    UI32_T                              ccm_ltm_priority;                                     /*8*/
    UI32_T                              row_status;

    CFM_TYPE_MdLevel_T                  md_level;
    CFM_TYPE_CcmStatus_T                ccm_status;                                           /*7*/
    CFM_TYPE_MP_Direction_T             direction;                                            /*3*/

    UI16_T                              md_name_len;
    UI16_T                              ma_name_len;

    BOOL_T                              active;                                               /*5*/

    UI8_T                               mac_addr_a[SYS_ADPT_MAC_ADDR_LEN];                    /*9*/
    UI8_T                               md_name_a[CFM_TYPE_MD_MAX_NAME_LENGTH+1];
    UI8_T                               ma_name_a[CFM_TYPE_MA_MAX_NAME_LENGTH+1];

    /*fng
      */
    CFM_TYPE_FNG_State_T                fng_state;                                            /*6*/
    CFM_TYPE_FNG_HighestDefectPri_T     highest_pri_defect;     /* defect ever occurred b4 */     /*13*/
    CFM_TYPE_FNG_HighestDefectPri_T     cur_highest_pri_defect; /* current highest defect  */
    CFM_TYPE_FNG_LowestAlarmPri_T       low_pri_def;                                          /*10*/
    UI32_T                              fng_reset_time;                                       /*12*/
    UI32_T                              fng_alarm_time;                                       /*11*/

    /*MaDefectIndication
      */
    UI8_T                               defects;                                              /*14*/

    UI32_T                              ccm_seq_error;                                        /*17*/
    UI32_T                              cci_sent_ccms;                                        /*18*/

    /*lbr
      */
    UI32_T                              lbr_out;                                               /*25*/
    UI32_T                              lbr_in;                                                /*20*/
    UI32_T                              lbr_in_out_of_order;                                   /*21*/
    UI32_T                              lbr_bad_msdu;                                          /*22*/

    /*lbm
      */
    UI32_T                              next_lbm_trans_id;                                     /*19*/
    UI32_T                              trans_lbm_seq_num;                                     /*35*/
    UI32_T                              trans_lbm_dst_mep_id;                                  /*28*/
    I32_T                               trans_lbm_vlan_priority;                               /*32*/

    I16_T                               trans_lbm_msg;                                         /*30*/

    BOOL_T                              trans_lbm_status;                                      /*26*/
    BOOL_T                              trans_lbm_dst_is_mep_id;                               /*29*/
    BOOL_T                              trans_lbm_vlan_drop_enabled;                           /*33*/
    BOOL_T                              trans_lbm_result_ok;                                   /*34*/

    UI8_T                               trans_lbm_dst_mac_addr_a[SYS_ADPT_MAC_ADDR_LEN];       /*27*/

    /*ltr
     */
    UI32_T                              unexp_ltr_in;                                          /*24*/
    UI8_T                               ltr_reply_ttl;
    UI8_T                               ltr_relay_action;

    /*ltm
      */
    UI32_T                              ltm_next_seq_num;                                      /*23*/
    UI32_T                              trans_ltm_target_mep_id;                               /*39*/
    UI32_T                              trans_ltm_seq_num;                                     /*43*/

    BOOL_T                              trans_ltm_status;                                      /*36*/
    BOOL_T                              trans_ltm_target_is_mep_id;                            /*40*/
    BOOL_T                              trans_ltm_result;                                      /*42*/
    BOOL_T                              ltm_use_fdb_only;                                      /*37*/

    UI8_T                               trans_ltm_ttl;                                         /*41*/
    UI8_T                               trans_ltm_egress_id_a[SYS_ADPT_MAC_ADDR_LEN+2];        /*44*/
    UI8_T                               trans_ltm_target_mac_addr_a[SYS_ADPT_MAC_ADDR_LEN];    /*38*/
}CFM_OM_MepInfo_T;

typedef struct CFM_OM_MipInfo_S
{
    UI32_T                              md_index;
    UI32_T                              ma_index;
    UI32_T                              vid;
    UI32_T                              lport;

    UI16_T                              md_name_len;
    UI16_T                              ma_name_len;

    CFM_TYPE_MdLevel_T                  md_level;

    UI8_T                               md_name_a[CFM_TYPE_MD_MAX_NAME_LENGTH+1];
    UI8_T                               ma_name_a[CFM_TYPE_MA_MAX_NAME_LENGTH+1];
}CFM_OM_MipInfo_T;

typedef struct CFM_OM_RemoteMepCrossCheck_S
{
    UI32_T                              incoming_port;
    UI32_T                              cc_life_time;
    UI32_T                              age_of_last_cc;
    UI32_T                              frame_loss;
